ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/ПротоколОФПСдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколОФПСдачаНормативов</name>
  <basedOn>Document.СоревнованиеОФПСдачаНормативов</basedOn>
  <registerRecords>InformationRegister.ДостиженияСпортсменовПоПротоколу</registerRecords>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.РезультатыВыполненияПоказателейИНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыПараметровСоревнованиийОФПСдачаНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СоревнованиеОФПСдачаНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоревнования</name>
    <type>
      <types>EnumRef.ТипыСдачиНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Очки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Попытки</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПопытки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПопытки</name>
      <type>
        <types>CatalogRef.СостоянияПопыток</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявленныеНормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/InformationRegisters/ОценкиПрохожденияНормативов/ОценкиПрохожденияНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиПрохожденияНормативов</name>
  <resources>
    <name>РезультатЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипПодсчетаРезультата</name>
    <type>
      <types>EnumRef.ТипПодсчетаРезультата</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ТипыРезультатов/ТипыРезультатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРезультатов</name>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Женский</name>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ТипПодсчетаРезультата/ТипПодсчетаРезультата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПодсчетаРезультата</name>
  <enumValues>
    <name>СуммаПопыток</name>
  </enumValues>
  <enumValues>
    <name>МинимальноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>МаксимальноеЗначение</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/Forms/ФормаВводаРезультатовПопыток/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьДоступность(Параметры.ТипРезультата);
	ТипРезультата = Параметры.ТипРезультата;
	
	Для Индекс = 0 По Параметры.МассивПопыток.Количество()-1 Цикл
		строкаПопытка = таблицаПопыток.Добавить();
		ЗаполнитьЗначенияСвойств(строкаПопытка,Параметры.МассивПопыток[Индекс]);
		строкаПопытка.НомерПопытки = Индекс + 1;
		строкаПопытка.РезультатБулево = ?(Параметры.МассивПопыток[Индекс].РезультатБулево, "Выполнил", "Не выполнил");
	КонецЦикла;
	
	ЗаполнитьНастройкиПоПараметрамСФормы(Параметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьРезультатЧислоВСтроку();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыНаФорме

&НаКлиенте
Процедура таблицаПопытокРезультатСтрокаПриИзменении(Элемент)
	
	текДанные = Элементы.таблицаПопыток.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	УчетСпортсменовОбщегоНазначенияКлиентСервер.ПроверитьРезультатСтроковыйПриИзменении(текДанные.РезультатСтрока, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура таблицаПопытокПриИзменении(Элемент)
	
	ТекДанные = Элементы.таблицаПопыток.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.НомерПопытки = таблицаПопыток.Количество();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВнестиРезультаты(Команда)
	
	массивПопыток = Новый Массив;
	Для Каждого строкаПопытка Из таблицаПопыток Цикл
		Если Пересчитывать Тогда
			строкаПопытка.РезультатЧисло = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяИзСтрокиВМиллесекунды(строкаПопытка.РезультатСтрока);
		КонецЕсли;	
		структураПопытка = Новый Структура("НомерПопытки, РезультатЧисло, РезультатСтрока, РезультатБулево, Состояние, УчитыватьВПодсчетеРезультата");
		ЗаполнитьЗначенияСвойств(структураПопытка, строкаПопытка,,"РезультатБулево");
		структураПопытка.РезультатБулево = ?(строкаПопытка.РезультатБулево = "Выполнил", Истина, Ложь);
		структураПопытка.УчитыватьВПодсчетеРезультата = ПолучитьСостояниеНаСервере(структураПопытка.Состояние);
		массивПопыток.Добавить(структураПопытка);
	КонецЦикла;
	
	ЭтаФорма.Закрыть(Новый Структура("Попытки, ТипПодсчетаРезультата",массивПопыток, ТипПодсчетаРезультата));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСостояниеНаСервере(Состояние)
	Возврат Состояние.УчитыватьВПодсчетеРезультата 
КонецФункции	
	
&НаСервере
Процедура УстановитьВидимостьДоступность(ТипРезультата)
	
	Пересчитывать = ТипРезультата = Перечисления.ТипыРезультатов.Время;; 
	Элементы.таблицаПопытокРезультатЧисло.Видимость  = ТипРезультата = Перечисления.ТипыРезультатов.Число;
	Элементы.таблицаПопытокРезультатБулево.Видимость = ТипРезультата = Перечисления.ТипыРезультатов.Булево;
	Элементы.таблицаПопытокРезультатСтрока.Видимость = Пересчитывать;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРезультатЧислоВСтроку()
	
	Если Пересчитывать Тогда
		Для Каждого строкаПопытка Из таблицаПопыток Цикл
			строкаПопытка.РезультатСтрока = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяВМиллесекундахВСтроку(строкаПопытка.РезультатЧисло);
		КонецЦикла;
	Иначе
		Возврат
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНастройкиПоПараметрамСФормы(Параметры)
	
	Пол = Параметры.Пол;
	МеждународнаяВозрастнаяГруппа = Параметры.МеждународнаяВозрастнаяГруппа;
	ПолПредставление = ?(Параметры.Пол = Перечисления.ПолФизическогоЛица.Женский, "М",?(Параметры.Пол = Перечисления.ПолФизическогоЛица.Мужской,"М","Неопределен"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пол", Параметры.Пол);
	Запрос.УстановитьПараметр("Норматив", Параметры.Норматив);
	Запрос.УстановитьПараметр("МеждународнаяВозрастнаяГруппа", Параметры.МеждународнаяВозрастнаяГруппа);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОценкиПрохожденияНормативов.КоличествоПопыток КАК КоличествоПопыток,
	               |	ОценкиПрохожденияНормативов.ТипПодсчетаРезультата КАК ТипПодсчетаРезультата
	               |ИЗ
	               |	РегистрСведений.ОценкиПрохожденияНормативов КАК ОценкиПрохожденияНормативов
	               |ГДЕ
	               |	ОценкиПрохожденияНормативов.Пол = &Пол
	               |	И ОценкиПрохожденияНормативов.Норматив = &Норматив
	               |	И ОценкиПрохожденияНормативов.МеждународнаяВозрастнаяГруппа = &МеждународнаяВозрастнаяГруппа";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Выборка);
		Если таблицаПопыток.Количество() = 0 Тогда
			Для Индекс = 1 По Выборка.КоличествоПопыток Цикл
				строкаПопытка = таблицаПопыток.Добавить();
				строкаПопытка.НомерПопытки = Индекс;
				Если ТипРезультата = Перечисления.ТипыРезультатов.Булево Тогда
					строкаПопытка.РезультатБулево   = "Не выполнил";
				ИначеЕсли ТипРезультата = Перечисления.ТипыРезультатов.Время Тогда
					строкаПопытка.РезультатСтрока   = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяВМиллесекундахВСтроку(0);
				Иначе
					строкаПопытка.РезультатЧисло    = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПодсчетаРезультата) Тогда
		ТипПодсчетаРезультата = Перечисления.ТипПодсчетаРезультата.МинимальноеЗначение;
	КонецЕсли;
	
	Если КоличествоПопыток = 0 Тогда
		КоличествоПопыток = 1;
	КонецЕсли;
	
	Если таблицаПопыток.Количество() = 0 Тогда
		строкаПопытка = таблицаПопыток.Добавить();
		строкаПопытка.НомерПопытки = 1;
		Если ТипРезультата = Перечисления.ТипыРезультатов.Булево Тогда
			строкаПопытка.РезультатБулево   = "Не выполнил";
		ИначеЕсли ТипРезультата = Перечисления.ТипыРезультатов.Время Тогда
			строкаПопытка.РезультатСтрока   = УчетСпортсменовОбщегоНазначенияКлиентСервер.ПересчитатьВремяВМиллесекундахВСтроку(0);
		Иначе
			строкаПопытка.РезультатЧисло    = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
